tititititotototo/STM32F407_DISCOVERY_UCOS_II/Micrium/Examples/ST/STM3240G-EVAL/OS2/UserApp/app_user.c
/*
 * app_user.c
 *
 *  Created on: 2017. 1. 30.
 *      Author: grooves
 */

/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                            EXAMPLE CODE
*
*                                     ST Microelectronics STM32
*                                              on the
*
*                                           STM3240G-EVAL
*                                         Evaluation Board
*
* Filename      : app.c
* Version       : V1.00
* Programmer(s) : DC
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include  <stdarg.h>
#include  <stdio.h>
#include  <math.h>
#include  <stm32f4xx_hal.h>

#include  <cpu.h>
#include  <lib_math.h>
#include  <lib_mem.h>
#include  <os.h>

#include  <app_cfg.h>
#include  <bsp.h>
#include  <bsp_user.h>

#if (APP_CFG_SERIAL_EN == DEF_ENABLED)
#include  <app_serial.h>
#endif


/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/

#define  APP_TASK_EQ_0_ITERATION_NBR              16u
#define  APP_TASK_EQ_1_ITERATION_NBR              18u


/*
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*/

                                                                /* --------------- APPLICATION GLOBALS ---------------- */
static  OS_STK       AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE];

                                                                /* ------------- PROBE EXAMPLE VARIABLES -------------- */
        CPU_INT32U   AppProbe_CtrVal;
        CPU_INT32U   AppProbe_Slider;

                                                                /* --------------- SEMAPHORE TASK TEST ---------------- */
static  OS_STK       AppTaskEvent0Stk[APP_CFG_TASK_OBJ_STK_SIZE];

static  OS_STK       AppTaskEvent1Stk[APP_CFG_TASK_OBJ_STK_SIZE];
                                                                /* ------------ FLOATING POINT TEST TASK -------------- */
static  OS_STK       AppTaskEq0FpStk[APP_CFG_TASK_EQ_STK_SIZE];
static  OS_STK       AppTaskEq1FpStk[APP_CFG_TASK_EQ_STK_SIZE];

#if (OS_SEM_EN > 0u)
static  OS_EVENT    *AppTraceSem;
#endif

#if (OS_SEM_EN > 0u)
static  OS_EVENT    *AppTaskObjSem;
#endif

#if (OS_MUTEX_EN > 0u)
static  OS_EVENT    *AppTaskObjMutex;
#endif

#if (OS_Q_EN > 0u)
static  OS_EVENT    *AppTaskObjQ;
#endif

#if (OS_FLAG_EN > 0u)
static  OS_FLAG_GRP *AppTaskObjFlag;
#endif


/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

static  void  AppTaskCreate  (void);
static  void  AppEventCreate (void);

static  void  AppTaskStart   (void  *p_arg);

static  void  AppTaskEq0Fp   (void  *p_arg);                   /* Floating Point Equation 0 task.                      */
static  void  AppTaskEq1Fp   (void  *p_arg);                   /* Floating Point Equation 1 task.                      */
static  void  AppTaskEvent0  (void  *p_arg);
static  void  AppTaskEvent1  (void  *p_arg);


/*
*********************************************************************************************************
*                                                main()
*
* Description : This is the standard entry point for C code.  It is assumed that your code will call
*               main() once you have performed all necessary initialization.
*
* Arguments   : none
*
* Returns     : none
*
* Notes       : 1) STM32F4xx HAL library initialization:
*                      a) Configures the Flash prefetch, intruction and data caches.
*                      b) Configures the Systick to generate an interrupt. However, the function ,
*                         HAL_InitTick(), that initializes the Systick has been overwritten since Micrium's
*                         RTOS has its own Systick initialization and it is recommended to initialize the
*                         Systick after multitasking has started.
*
*********************************************************************************************************
*/

int main(void)
{
#if (OS_TASK_NAME_EN > 0)
    CPU_INT08U  err;
#endif

    HAL_Init();                                                 /* See Note 1.                                          */

    Mem_Init();                                                 /* Initialize Memory Managment Module                   */
    Math_Init();                                                /* Initialize Mathematical Module                       */

    BSP_IntDisAll();                                            /* Disable all Interrupts.                              */

