tititititotototo/STM32F407_DISCOVERY_UCOS_II/Micrium/Examples/ST/STM3240G-EVAL/OS2/UserApp/app_user.c
    OSInit();                                                   /* Init uC/OS-II.                                       */

    OSTaskCreateExt( AppTaskStart,                              /* Create the start task                                */
                     0,
                    &AppTaskStartStk[APP_CFG_TASK_START_STK_SIZE - 1],
                     APP_CFG_TASK_START_PRIO,
                     APP_CFG_TASK_START_PRIO,
                    &AppTaskStartStk[0],
                     APP_CFG_TASK_START_STK_SIZE,
                     0,
                    (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR));

#if (OS_TASK_NAME_EN > 0)
    OSTaskNameSet(         APP_CFG_TASK_START_PRIO,
                  (INT8U *)"Start Task",
                           &err);
#endif

    OSStart();                                                  /* Start multitasking (i.e. give control to uC/OS-II).  */

    while (DEF_ON) {                                            /* Should Never Get Here.                               */
        ;
    }
}


/*
*********************************************************************************************************
*                                          STARTUP TASK
*
* Description : This is an example of a startup task.  As mentioned in the book's text, you MUST
*               initialize the ticker only once multitasking has started.
*
* Arguments   : p_arg   is the argument passed to 'AppTaskStart()' by 'OSTaskCreate()'.
*
* Returns     : none
*
* Notes       : 1) The first line of code is used to prevent a compiler warning because 'p_arg' is not
*                  used.  The compiler should not generate any code for this statement.
*********************************************************************************************************
*/

static  void  AppTaskStart (void *p_arg)
{
    CPU_INT32U  r0;
    CPU_INT32U  r1;
    CPU_INT32U  r2;
    CPU_INT32U  r3;
    CPU_INT32U  r4;
    CPU_INT32U  r5;
    CPU_INT32U  r6;
    CPU_INT32U  r7;
    CPU_INT32U  r8;
    CPU_INT32U  r9;
    CPU_INT32U  r10;
    CPU_INT32U  r11;
    CPU_INT32U  r12;

    int endNum = 50;

   (void)p_arg;

    r0  =  0u;                                                  /* Initialize local variables.                          */
    r1  =  1u;
    r2  =  2u;
    r3  =  3u;
    r4  =  4u;
    r5  =  5u;
    r6  =  6u;
    r7  =  7u;
    r8  =  8u;
    r9  =  9u;
    r10 = 10u;
    r11 = 11u;
    r12 = 12u;

    BSP_Init();                                                 /* Initialize BSP functions                             */
    CPU_Init();                                                 /* Initialize the uC/CPU services                       */

#if (OS_TASK_STAT_EN > 0)
    OSStatInit();                                               /* Determine CPU capacity                               */
#endif

#ifdef CPU_CFG_INT_DIS_MEAS_EN
    CPU_IntDisMeasMaxCurReset();
#endif

#if 0
//#if (APP_CFG_SERIAL_EN == DEF_ENABLED)
    if (App_SerialInit() == DEF_FAIL)                                           /* Initialize Serial Communication for Application ...  */
    {
        BSP_LED_On(1u);
         while(1);
    }
#endif

    //BspUart2GpioInit();
    UartInit();

    UartSendChar('X');
    //AppEventCreate();                                           /* Create Applicaiton kernel objects                    */

    UartSendChar('O');
    AppTaskCreate();                                            /* Create Application tasks                             */

    BSP_LED_Off(0u);
    AppProbe_CtrVal = 0u;
    AppProbe_Slider = 50u;

    while (DEF_TRUE) {                                          /* Task body, always written as an infinite loop.       */
        BSP_LED_Toggle(0u);
        OSTimeDlyHMSM(0u, 0u, 0u, (AppProbe_Slider));

        UserPrint("\x1B[43m");
        UserPrintXY(0,AppProbe_CtrVal,0,"Task0");
        //UserPrint("Count %d\n",AppProbe_CtrVal);

        if ((r0  !=  0u) ||                                     /* Check task context.                                  */
            (r1  !=  1u) ||
            (r2  !=  2u) ||
            (r3  !=  3u) ||
            (r4  !=  4u) ||
            (r5  !=  5u) ||
            (r6  !=  6u) ||
            (r7  !=  7u) ||
            (r8  !=  8u) ||
            (r9  !=  9u) ||
            (r10 != 10u) ||
            (r11 != 11u) ||
            (r12 != 12u)) {
        	UserPrint(("Context Error\n"));
        }

        AppProbe_CtrVal++;

        if (AppProbe_CtrVal >= endNum) {
        //if (AppProbe_CtrVal >= DEF_INT_32_MASK) {
        	if (endNum > 0)
        		endNum--;

        	if (endNum == 0)
        		endNum = 50;

            AppProbe_CtrVal = 0u;
        }
    }
}

/*
*********************************************************************************************************
*                                          AppTaskCreate()
*
* Description : Create Application Tasks.
*
* Argument(s) : none
*
* Return(s)   : none
*
* Caller(s)   : AppTaskStart()
*
* Note(s)     : none.
*********************************************************************************************************
*/


static  void AppTaskCreate(void)
{
#if (OS_TASK_NAME_EN > 0)
    CPU_INT08U  err;
#endif
//
//                                                                // ----------- CREATE KERNEL EVENT TEST TASK ----------
//    OSTaskCreateExt( AppTaskEvent0,
//                     0,
//                    &AppTaskEvent0Stk[APP_CFG_TASK_OBJ_STK_SIZE - 1],
//                     APP_CFG_TASK_EVENT0_PRIO,
//                     APP_CFG_TASK_EVENT0_PRIO,
//                    &AppTaskEvent0Stk[0],
//                     APP_CFG_TASK_OBJ_STK_SIZE,
//                     0,
//                    (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR));
//
//#if (OS_TASK_NAME_EN > 0)
//    OSTaskNameSet(         APP_CFG_TASK_EVENT0_PRIO,
//                  (INT8U *)"Kernel Events Task 0",
//                           &err);
//#endif
//
//    OSTaskCreateExt( AppTaskEvent1,
//                     0,
//                    &AppTaskEvent1Stk[APP_CFG_TASK_OBJ_STK_SIZE - 1],
//                     APP_CFG_TASK_EVENT1_PRIO,
//                     APP_CFG_TASK_EVENT1_PRIO,
//                    &AppTaskEvent1Stk[0],
//                     APP_CFG_TASK_OBJ_STK_SIZE,
//                     0,
//                    (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR));
//
//#if (OS_TASK_NAME_EN > 0)
//    OSTaskNameSet(         APP_CFG_TASK_EVENT1_PRIO,
//                  (INT8U *)"Kernel Events Task 1",
//                           &err);
//#endif

                                                                // ------------- CREATE FLOATING POINT TASK -----------
    OSTaskCreateExt( AppTaskEq0Fp,
                     0,
                    &AppTaskEq0FpStk[APP_CFG_TASK_EQ_STK_SIZE - 1],
                     APP_CFG_TASK_EQ0_PRIO,
                     APP_CFG_TASK_EQ0_PRIO,
                    &AppTaskEq0FpStk[0],
                     APP_CFG_TASK_EQ_STK_SIZE,
                     0,
                    (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR | OS_TASK_OPT_SAVE_FP));

#if (OS_TASK_NAME_EN > 0)
    OSTaskNameSet(         APP_CFG_TASK_EQ0_PRIO,
                  (INT8U *)"FP  Equation 0",
                           &err);
#endif

