tititititotototo/STM32F407_DISCOVERY_UCOS_II/Micrium/Examples/ST/STM3240G-EVAL/OS2/UserApp/app_user.c
    OSTaskCreateExt( AppTaskEq1Fp,
                     0,
                    &AppTaskEq1FpStk[APP_CFG_TASK_EQ_STK_SIZE - 1],
                     APP_CFG_TASK_EQ1_PRIO,
                     APP_CFG_TASK_EQ1_PRIO,
                    &AppTaskEq1FpStk[0],
                     APP_CFG_TASK_EQ_STK_SIZE,
                     0,
                    (OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR | OS_TASK_OPT_SAVE_FP));

#if (OS_TASK_NAME_EN > 0)
    OSTaskNameSet(         APP_CFG_TASK_EQ1_PRIO,
                  (INT8U *)"FP  Equation 1",
                           &err);
#endif
}


/*
*********************************************************************************************************
*                                           AppEventCreate()
*
* Description : Create application kernel event tasks.
*
* Argument(s) : none
*
* Return(s)   : none
*
* Caller(s)   : AppTaskStart()
*
* Note(s)     : none.
*********************************************************************************************************
*/

/*
static  void  AppEventCreate (void)
{
    CPU_INT08U  os_err;

#if (OS_SEM_EN > 0u)
    AppTaskObjSem = OSSemCreate(0);
    AppTraceSem   = OSSemCreate(1);

#if (OS_EVENT_NAME_EN > 0)
    OSEventNameSet(         AppTaskObjSem,
                   (INT8U *)"Trace Lock",
                            &os_err);

    OSEventNameSet(         AppTraceSem,
                   (INT8U *)"Sem Test",
                            &os_err);
#endif
#endif

#if (OS_MUTEX_EN > 0u)
    AppTaskObjMutex = OSMutexCreate( APP_CFG_MUTEX_PRIO,
                                     &os_err);

#if (OS_EVENT_NAME_EN > 0)
    OSEventNameSet(         AppTaskObjMutex,
                   (INT8U *)"Mutex Test",
                            &os_err);
#endif
#endif

#if (OS_Q_EN > 0u)
    AppTaskObjQ = OSQCreate((void *)&AppTaskObjQ,
                                      1);

#if (OS_EVENT_NAME_EN > 0)
    OSEventNameSet(          AppTaskObjQ,
                   (INT8U *)"Queue Test",
                            &os_err);
#endif
#endif

#if (OS_FLAG_EN > 0u)
    AppTaskObjFlag = OSFlagCreate( DEF_BIT_NONE,
                                   &os_err);

#if (OS_EVENT_NAME_EN > 0)
    OSFlagNameSet(         AppTaskObjFlag,
                  (INT8U *)"Flag Test",
                           &os_err);
#endif
#endif
}
*/

/*
*********************************************************************************************************
*                                          AppTaskEvent0()
*
* Description : Test uC/OS-II Events.
*
* Argument(s) : p_arg is the argument passed to 'AppTaskEvent0' by 'OSTaskCreate()'.
*
* Return(s)   : none
*
* Caller(s)   : This is a task
*
* Note(s)     : none.
*********************************************************************************************************
*/

/*
static  void  AppTaskEvent0 (void  *p_arg)
{
    CPU_INT08U  os_err;
    //unsigned char getRandom = 0;

    (void)p_arg;
    unsigned int x = 0;
    SERIAL_DEV_CFG * pcfg;

    while (DEF_TRUE) {
#if (OS_SEM_EN > 0u)
        os_err = OSSemPost(AppTaskObjSem);
#endif

#if (OS_MUTEX_EN > 0u)
        OSMutexPend( AppTaskObjMutex,
                     0,
                    &os_err);

        APP_TRACE_INFO(("T0 MtxPend\n"));
        UartSendChar('X');

        OSTimeDlyHMSM(0u, 0u, 0u, 100u);

        os_err = OSMutexPost(AppTaskObjMutex);
        APP_TRACE_INFO(("T0 MtxPost\n"));
#endif

#if (OS_Q_EN > 0u)
        os_err = OSQPost(        AppTaskObjQ,
                         (void *)1u);
        APP_TRACE_INFO(("T0 QPost\n"));
#endif

#if (OS_FLAG_EN > 0u)
        OSFlagPost( AppTaskObjFlag,
                    DEF_BIT_00,
                    OS_FLAG_SET,
                   &os_err);
        APP_TRACE_INFO(("T0 FPost\n"));
#endif
        APP_TRACE_INFO(("T0 Dly\n"));
        OSTimeDlyHMSM(0u, 0u, 0u, 10u);

        pcfg = (SERIAL_DEV_CFG *)&SerialDevCfg_STM32_USART2;

        x = pcfg->BSP_API->ClkFreqGet();

        //getRandom = rand(256);

        APP_TRACE_INFO(("Event test task 0 running ....\n"));
       // APP_TRACE_INFO(("UART2 brr %x....\n",*(unsigned int*)(0x40004408)));
        //APP_TRACE_INFO(("Get UART2 Clk %d....\n",x));
       // APP_TRACE_INFO(("TEST PRINTF %x\n",x));
    }
}
*/

/*
*********************************************************************************************************
*                                          AppTaskEvent1()
*
* Description : Test uC/OS-II events.
*
* Argument(s) : p_arg is the argument passed to 'AppTaskEvent1' by 'OSTaskCreate()'.
*
* Return(s)   : none
*
* Caller(s)   : This is a task
*
* Note(s)     : none.
*********************************************************************************************************
*/

/*
static  void  AppTaskEvent1 (void  *p_arg)
{
    CPU_INT08U  os_err;


    (void)p_arg;

    while (DEF_TRUE) {

#if (OS_SEM_EN > 0u)
        OSSemPend( AppTaskObjSem,
                   0,
                  &os_err);
#endif

#if (OS_MUTEX_EN > 0u)
        OSMutexPend( AppTaskObjMutex,
                     0,
                    &os_err);
        APP_TRACE_INFO(("T1 MtxPend\n"));

        os_err = OSMutexPost(AppTaskObjMutex);
        APP_TRACE_INFO(("T1 MtxPost\n"));
#endif

#if (OS_Q_EN > 0u)
        OSQPend( AppTaskObjQ,
                 0,
                &os_err);
        APP_TRACE_INFO(("T1 QPend\n"));
#endif

#if (OS_FLAG_EN > 0u)
        OSFlagPend( AppTaskObjFlag,
                    DEF_BIT_00,
                    OS_FLAG_WAIT_SET_ALL + OS_FLAG_CONSUME,
                    0,
                   &os_err);
        APP_TRACE_INFO(("T0 FPend\n"));
#endif
        APP_TRACE_INFO(("T1 Dly\n"));
        OSTimeDlyHMSM(0u, 0u, 0u, 10u);
        APP_TRACE_INFO(("Event test task 1 running ....\n"));
    }
}
*/

/*
*********************************************************************************************************
*                                             AppTaskEq0Fp()
*
* Description : This task finds the root of the following equation.
*               f(x) =  e^-x(3.2 sin(x) - 0.5 cos(x)) using the bisection mehtod
*
* Argument(s) : p_arg   is the argument passed to 'AppTaskEq0Fp' by 'OSTaskCreate()'.
*
* Return(s)   : none.
*
* Note(s)     : 1) Atollic TrueSTUDIO needs special settings to output floating point format; however,
*                  IAR and KeilMDK should work properly.
*********************************************************************************************************
*/

void  AppTaskEq0Fp (void  *p_arg)
{
	while (DEF_TRUE)
	{
		//BSP_LED_Toggle(0u);
		OSTimeDlyHMSM(0u, 0u, 0u,10);

		UserPrint("\x1B[41m");
		UserPrintXY(0,AppProbe_CtrVal,5,"Task1");
	}
}

void  AppTaskEq1Fp (void  *p_arg)
{
	while (DEF_TRUE)
	{
		//BSP_LED_Toggle(0u);
		OSTimeDlyHMSM(0u, 0u, 0u,10);

		UserPrint("\x1B[42m");
		UserPrintXY(0,AppProbe_CtrVal,9,"Task2");
	}
}
//void  AppTaskEq0Fp (void  *p_arg)
//{
//    CPU_FP32    a;
//    CPU_FP32    b;
//    CPU_FP32    c;
//    CPU_FP32    eps;
//    CPU_FP32    f_a;
//    CPU_FP32    f_c;
//    CPU_FP32    delta;
//    CPU_INT08U  iteration;
//    RAND_NBR    wait_cycles;
//
//
//    while (DEF_TRUE) {
//        eps       = 0.00001;
//        a         = 3.0;
//        b         = 4.0;
//        delta     = a - b;
//        iteration = 0u;
//        if (delta < 0) {
//            delta = delta * -1.0;
//        }
//
//        while (((2.00 * eps) < delta) ||
//               (iteration    > 20u  )) {
//            c   = (a + b) / 2.00;
//            f_a = (exp((-1.0) * a) * (3.2 * sin(a) - 0.5 * cos(a)));
//            f_c = (exp((-1.0) * c) * (3.2 * sin(c) - 0.5 * cos(c)));
//
//            if (((f_a > 0.0) && (f_c < 0.0)) ||
//                ((f_a < 0.0) && (f_c > 0.0))) {
//                b = c;
//            } else if (((f_a > 0.0) && (f_c > 0.0)) ||
//                       ((f_a < 0.0) && (f_c < 0.0))) {
//                a = c;
//            } else {
//                break;
//            }
//
//            delta = a - b;
//            if (delta < 0) {
//               delta = delta * -1.0;
//            }
//            iteration++;
//
//            wait_cycles = Math_Rand();
//            wait_cycles = wait_cycles % 1000;
//
//            while (wait_cycles > 0u) {
//                wait_cycles--;
//            }
//
//            if (iteration > APP_TASK_EQ_0_ITERATION_NBR) {
//                APP_TRACE_INFO(("AppTaskEq0Fp() max # iteration reached\n"));
//                break;
//            }
//        }
//
//        APP_TRACE_INFO(("Eq0 Task Running ....\n"));
//
//        if (iteration == APP_TASK_EQ_0_ITERATION_NBR) {
//#if 0                                                           // See Note 1.
//            APP_TRACE_INFO(("Root = %f; f(c) = %f; #iterations : %d\n", c, f_c, iteration));
//#else
//            APP_TRACE_INFO(("Eq0 task; #iterations : %d\n", iteration));
//#endif
//        }
//    }
//}



